# Tap useful formulae
tap 'homebrew/science'
tap 'homebrew/versions'
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'homebrew/dupes'

# important command line tools
brew 'rsync'
brew 'git'
brew 'gcc'
brew ‘watch’

# Install GUI apps
cask 'atom'
# cask 'dropbox'
# cask 'geneious'
# cask 'gitkraken'
cask 'google-chrome'
# cask 'kaleidoscope'
# cask 'launchbar'
cask 'skype'
cask 'slack'
cask 'transmit'
cask 'vlc'
cask './formula/bbedit.rb'
cask 'iterm2'
cask 'rstudio'
cask 'spotify'

# Install java
# cask 'java'

# Install ruby (ruby-build allows multiple installs)
brew 'rbenv'
brew 'ruby-build'
# https://github.com/rbenv/ruby-build


# Install python formulae
brew 'python'
# brew 'pyqt'
brew 'zmq' #zeromq messaging

# Install node version manager (node comes later)
brew 'nvm'

# Install science formulae
cask 'figtree'
brew 'beast'
brew 'beagle'
brew 'raxml'
brew 'mafft'
brew 'fasttree'
brew 'gcc49'
brew 'r'

# Install latex formulae
cask 'mactex'
brew 'aspell', args: ['--with-lang-en']

# Install other formulae
brew 'heroku-toolbelt'
brew 'ec2-api-tools'
brew 'rethinkdb'
